# Shallow + DCAS configuration

nc: 10  # number of classes

scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # Shallow Conv stack
  - [    -1, 1, Conv, [32, 3, 1]]  # 0 - shallow_conv1 (no stride)
  - [    -1, 1, Conv, [64, 3, 2]]  # 1 - shallow_conv2 (stride=2)
  - [    -1, 1, Conv, [64, 3, 2]]  # 2 - shallow_conv3 (stride=4)

  # Original backbone
  - [    -1, 1, Conv, [64, 3, 2]]     # 3 - P1/2
  - [    -1, 1, Conv, [128, 3, 2]]    # 4 - P2/4
  - [    -1, 3, C2f, [128, True]]     # 5
  - [    -1, 1, Conv, [256, 3, 2]]    # 6 - P3/8
  - [    -1, 6, C2f, [256, True]]     # 7
  - [    -1, 1, Conv, [512, 3, 2]]    # 8 - P4/16
  - [    -1, 6, C2f, [512, True]]     # 9
  - [    -1, 1, DSPPF, [512]]         # 10

head:
  - [-1, 1, Conv, [512, 1, 1]]        # 11
  - [ 7, 1, Conv, [256, 3, 2]]        # 12
  - [[-1, 9, 11], 1, WeightedFusion, {'c_list': [256, 512, 512], 'c_out': 512}]  # 13
  - [-1, 3, C2f_EMA, [512]]           # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [ 5, 1, Conv, [128, 3, 2]]        # 16
  - [[-1, 7, 15], 1, WeightedFusion, {'c_list': [128, 256, 512], 'c_out': 256}]  # 17
  - [-1, 3, C2f_EMA, [256]]           # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [ 3, 1, Conv, [64, 3, 2]]         # 20
  - [[-1, 5, 19], 1, WeightedFusion, {'c_list': [64, 128, 256], 'c_out': 128}]  # 21
  - [-1, 3, C2f_EMA, [128]]           # 22 (P2/4-small)

  - [-1, 1, Conv, [128, 3, 2]]        # 23
  - [[-1, 18], 1, Concat, [1]]        # 24
  - [-1, 3, C2f, [256]]               # 25 (P3/8-medium)

  - [-1, 1, Conv, [256, 3, 2]]        # 26
  - [[-1, 14], 1, Concat, [1]]        # 27
  - [-1, 3, C2f, [512]]               # 28 (P4/16-large)

  - [[22, 25, 28], 1, Detect, [nc]]   # 29
